### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [2]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
file_to_load = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(file_to_load)

## Player Count

* Display the total number of players

In [3]:
total_players = purchase_data.groupby("SN")

Players = total_players["SN"].unique()

P_Count = Players.count()

In [4]:
Player_Count = pd.DataFrame(
    {
        "Total Players": [P_Count]
    }

)

Player_Count

   Total Players
0            576

In [2]:
########################################################################

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [9]:
UniItem = purchase_data.groupby("Item Name")

unique_item = UniItem["Item Name"].unique()

UniqueCount = unique_item.count() #Notes: Using this for DataFrame

UniqueCount

179

In [10]:

Item_price = purchase_data["Item Name"]

ItemCount = Item_price.count() #Notes: Use this for DataFrame

ItemCount  #Notes: Using this for DataFrame

780

In [11]:
Avg = round(purchase_data["Price"].mean(),2)

Avg   #Notes: Use this for DataFrame

3.05

In [12]:
Total_Revenue = purchase_data["Price"].sum()

Total_Revenue  #Notes: Use this for DataFram

2379.77

In [13]:
Summary = pd.DataFrame(
    {
    "Number of Unique Items":[UniqueCount],
    "Average Price":[Avg],
    "Number of Purchases":[ItemCount],
    "Total Revenue":[Total_Revenue]           
}
)

Summary

   Number of Unique Items  Average Price  Number of Purchases  Total Revenue
0                     179           3.05                  780        2379.77

In [ ]:
######################### My answer above ##################################

   Number of Unique Items Average Price Number of Purchases Total Revenue
0                     183         $3.05                 780     $2,379.77

In [ ]:
############################################################################

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [16]:
#purchase_data.head()

In [22]:
gender = purchase_data["Gender"].value_counts()

gender

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [23]:
gendercount = purchase_data.groupby("Gender")

New_gendercount = gendercount["SN"].nunique()

New_gendercount.head()

Total_gen = New_gendercount.sum()


Percentage = round((New_gendercount/Total_gen) * 100, 2)

In [24]:
Total_gender = New_gendercount.sum()

Total_gender

576

In [25]:
x = New_gendercount.unique()
y = Percentage.unique()

In [26]:
Gender_Demo = pd.DataFrame(
    {
        "Count Of Gender": x,
        "Percentage of Player": Percentage
        
    }

)



Gender_Demo

                       Count Of Gender  Percentage of Player
Gender
Female                              81                 14.06
Male                               484                 84.03
Other / Non-Disclosed               11                  1.91

                       Total Count  Percentage of Players
Male                           484                  84.03
Female                          81                  14.06
Other / Non-Disclosed           11                   1.91


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [27]:
PurCount = purchase_data.groupby("Gender")

AvgPrice = round(PurCount["Price"].mean(), 2)

AvgPrice


TotalPurchase = PurCount["Price"].sum()

TotalPurchase


PurCount = PurCount["Item Name"].count()

PurCount


AvgTotal = round(TotalPurchase/PurCount, 2)

AvgTotal

Gender
Female                   3.20
Male                     3.02
Other / Non-Disclosed    3.35
dtype: float64

In [28]:
Purchase_Analysis = pd.DataFrame(
    {
        "Purchase Count": PurCount,
        "Average Purcahse": AvgPrice,
        "Total Purchase Value": TotalPurchase,
        "Avg Total Purchase per Person": AvgTotal
    }
        
)

Purchase_Analysis

,Purchase Count,Average Purcahse,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,3.20,361.94,3.20
Male,652,3.02,1967.64,3.02
Other / Non-Disclosed,15,3.35,50.19,3.35

In [ ]:
############################ My Answer Above #############################################

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,$3.20,$361.94,$4.47
Male,652,$3.02,"$1,967.64",$4.07
Other / Non-Disclosed,15,$3.35,$50.19,$4.56

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [ ]:
#purchase_data.head()

In [29]:
df = purchase_data

In [30]:
bins = [0, 9, 14, 19, 24, 29, 34, 39, 40]

In [31]:
group_by = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [32]:
df["Age Summary"] = pd.cut(df["Age"], bins, labels=group_by)

In [33]:
df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Summary
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,20-24
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,20-24
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24

In [34]:
df.count()

Purchase ID    780
SN             780
Age            780
Gender         780
Item ID        780
Item Name      780
Price          780
Age Summary    773
dtype: int64

In [35]:
PlayerCount = purchase_data.groupby("Age Summary")

Total_Players = PlayerCount["SN"].nunique()

Total_Players

Age Summary
<10       17
10-14     22
15-19    107
20-24    258
25-29     77
30-34     52
35-39     31
40+        5
Name: SN, dtype: int64

In [36]:
Perplayer = round((df["Age Summary"].value_counts()/576) * 100, 2)

In [37]:
Perplayer

20-24    63.37
15-19    23.61
25-29    17.53
30-34    12.67
35-39     7.12
10-14     4.86
<10       3.99
40+       1.04
Name: Age Summary, dtype: float64

In [38]:
Age_Demographic = pd.DataFrame(
    {
        "Total Count": Total_Players,
        "Percentage of Players": Perplayer
        
    }
)


Age_Demographic

       Total Count  Percentage of Players
10-14           22                   4.86
15-19          107                  23.61
20-24          258                  63.37
25-29           77                  17.53
30-34           52                  12.67
35-39           31                   7.12
40+              5                   1.04
<10             17                   3.99

In [ ]:
########################### My Anser Above ####################################

       Total Count  Percentage of Players
<10             17                   2.95
10-14           22                   3.82
15-19          107                  18.58
20-24          258                  44.79
25-29           77                  13.37
30-34           52                   9.03
35-39           31                   5.38
40+             12                   2.08

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [40]:
PurAnalysis = purchase_data

In [41]:
bins = [0, 9, 14, 19, 24, 29, 34, 39, 40]

group_by = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [42]:
df["Age Summary"] = pd.cut(df["Age"], bins, labels=group_by)

In [43]:

total = df.groupby("Age Summary")
total_avg = total["Price"]  #Total Purchase
Total_Purchase = total_avg.sum()

Total_Purchase  #Total Purchase Value Per Person

Age Summary
<10        77.13
10-14      82.78
15-19     412.89
20-24    1114.06
25-29     293.00
30-34     214.00
35-39     147.67
40+        16.71
Name: Price, dtype: float64

In [44]:
Purchse_Count = total_avg.count() #Purchase Count

Purchse_Count

Age Summary
<10       23
10-14     28
15-19    136
20-24    365
25-29    101
30-34     73
35-39     41
40+        6
Name: Price, dtype: int64

In [45]:
Avg_Purchase_Price = round(total_avg.mean(), 2)

Avg_Purchase_Price # Average Purchase Price

Age Summary
<10      3.35
10-14    2.96
15-19    3.04
20-24    3.05
25-29    2.90
30-34    2.93
35-39    3.60
40+      2.78
Name: Price, dtype: float64

In [46]:
Avg_Total_Purchase = round((Total_Purchase/576)* 100, 2)


Avg_Total_Purchase

Age Summary
<10       13.39
10-14     14.37
15-19     71.68
20-24    193.41
25-29     50.87
30-34     37.15
35-39     25.64
40+        2.90
Name: Price, dtype: float64

In [47]:
Purchase_Analysis = pd.DataFrame(
    {
        "Purchase Count": Purchse_Count,
        "Average Purchase Price": Avg_Purchase_Price,
        "Total Purchase Value": Avg_Total_Purchase,
        "Avg Total Purchase per Person": Total_Purchase
        
    }


)

Purchase_Analysis

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Summary,,,,
<10,23,3.35,13.39,77.13
10-14,28,2.96,14.37,82.78
15-19,136,3.04,71.68,412.89
20-24,365,3.05,193.41,1114.06
25-29,101,2.90,50.87,293.00
30-34,73,2.93,37.15,214.00
35-39,41,3.60,25.64,147.67
40+,6,2.78,2.90,16.71

In [ ]:
############################# My Answer Above ###################################

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,"$1,114.06",$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19
<10,23,$3.35,$77.13,$4.54

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [ ]:
TopS = purchase_data
TopS.head()

In [ ]:
TSpender = TopS.groupby("SN")
TP_Namelist = TSpender["SN"]

In [ ]:
Total_Purchase_Value = TSpender["Price"].sum()

In [ ]:
Average_Purchase_Price = round((TSpender["Price"].mean()), 2)

In [ ]:
Purchase_Count = TSpender["Price"].count()

In [ ]:
Top_Spenders = pd.DataFrame(
    
    { 
        "SN": TP_SN,
        "Purchase Count": Purchase_Count,
        "Average Purchase Price": Average_Purchase_Price,
        "Total Purchase Value": Total_Purchase_Value
     
        
        
    }


)


Top_Spenders.head()

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [48]:
Item = purchase_data[["Item ID", "Item Name", "Price"]]

Item.head()

   Item ID                                  Item Name  Price
0      108  Extraction, Quickblade Of Trembling Hands   3.53
1      143                          Frenzied Scimitar   1.56
2       92                               Final Critic   4.88
3      100                                Blindscythe   3.27
4      131                                       Fury   1.44

In [49]:
ItemDetail = Item.groupby("Item ID")

In [50]:
Purchase_Count = ItemDetail["Price"].count()
Purchase_Count.head()

Item ID
0    4
1    3
2    6
3    6
4    5
Name: Price, dtype: int64

In [51]:
Price = ItemDetail["Price"]

Item_Price = Price

In [52]:
Item_Name = ItemDetail["Item Name"]

In [53]:
Total_Purchase_Value = ItemDetail[ "Price"].sum()

#Total_Purchase_Value

In [54]:
Most_Popular_Time =  pd.DataFrame(
    {
        "Item Name": Item_Name,
        "PUrchase Count": Purchase_Count,
        "Item Price": Item_Price,
        "Total Purchase Value": Total_Purchase_Value
        
    }
          
  )


Most_Popular_Time.head()

,Item Name,PUrchase Count,Item Price,Total Purchase Value
Item ID,,,,
0,"(0, [Splinter, Splinter, Splinter, Splinter])",4,"(0, [1.28, 1.28, 1.28, 1.28])",5.12
1,"(1, [Crucifer, Crucifer, Crucifer])",3,"(1, [3.26, 3.26, 3.26])",9.78
2,"(2, [Verdict, Verdict, Verdict, Verdict, Verdi...",6,"(2, [2.48, 2.48, 2.48, 2.48, 2.48, 2.48])",14.88
3,"(3, [Phantomlight, Phantomlight, Phantomlight,...",6,"(3, [2.49, 2.49, 2.49, 2.49, 2.49, 2.49])",14.94
4,"(4, [Bloodlord's Fetish, Bloodlord's Fetish, B...",5,"(4, [1.7, 1.7, 1.7, 1.7, 1.7])",8.50

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77
82,Nirvana,9,$4.90,$44.10
19,"Pursuit, Cudgel of Necromancy",8,$1.02,$8.16

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [56]:
Most_Popular_Time.sort_values(by=['Total Purchase Value']).head()

,Item Name,PUrchase Count,Item Price,Total Purchase Value
Item ID,,,,
42,"(42, [The Decapitator])",1,"(42, [1.75])",1.75
104,"(104, [Gladiator's Glaive])",1,"(104, [1.93])",1.93
23,"(23, [Crucifer])",1,"(23, [1.99])",1.99
126,"(126, [Exiled Mithril Longsword])",1,"(126, [2.0])",2.00
125,"(125, [Whistling Mithril Warblade, Whistling M...",2,"(125, [1.0, 1.0])",2.00